{
    "en": {
        "uriObject": {
            "title": "URI Object",
            "p1": "The URI object provides an API equivalent to that of the <span class=\"inline\">window.location<span> object, but with added functionality that ensures correct behavior in the web and mobile environment."
        },
        
        "properties": {
            "title": "Properties",
            "items": [
                "<strong>pathname</strong> string: current URL, no query string, and no hash ",
                "<strong>URI</strong> string: complete URL.",
                "<strong>QS Map</strong>: Map with the list of variables passed through the query string.",
                "<strong>Hashtag</strong> string: Contains the URL fragment after the '#'. It is equivalent to the hash property of the Web API location object.",
                {
                    "t1": "<strong>Vars Map</strong>: Container map of the dynamic variables added in the definition of the ",
                    "l1": [
                        "/widgets#page",
                        "Widget Page"
                    ],
                    "t2": "URL"
                }
            ],
            "title2": "routing.historyBeyondHistory:",
            "p1": "The BeyondHistory object handles all the information associated with the user's browsing in the current session.",
            "title3": "Properties",
            "items2": [
                "<strong>current</strong>: string: Current browsing URL.",
                {
                    "t1": "<strong>initial</strong>: number: Refers to the index associated with the history of the web API of the browser on which the navigation begins inside the BeyondJS project. For this handling, beyond makes use of the web API's SessionStorage object, where it registers two properties:",
                    "items": [
                        "__beyond_navigation_position",
                        "__beyond_navigation_records"
                    ]
                },

                {
                    "t1": "<strong>position</strong> HistoryPosition:",
                    "items": [
                        "<strong>value</strong>: number: the value of the current navigation position in BeyondJS's history."
                    ]
                },

                "<strong>records</strong> HistoryRecords: An object of type Map that contains all the user's navigation entries in the current session."
            ]
        }
    }
}
