{
  "en": {
    "universal": {
      "h1#intro": [
        "Universal Typescript",
        "What is BeyondJS?"
      ],
      "cc1": "about",
      "p1": "BeyondJS es un meta-framework de nueva generación, basado en Typescript, diseñado para crear código universal y enfocado en el desarrollo modular de proyectos compatibles con diferentes entornos de ejecución Javascript.",
      "p2": "La arquitectura de BeyondJS permite trabajar de forma eficiente en proyectos grandes o pequeños sin que se afecte la productividad a medida que el proyecto crece, además garantiza al programador una experiencia de desarrollo homogénea.",
      "h2#why": "¿Por qué Modular+Universal?",
      "p3": "Deno, NodeJS y los navegadores modernos como Chrome o Edge, están todos basados en la misma tecnología Javascript.",
      "p4": {
        "s1": "<strong>El mismo motor, pero no las mismas técnicas de programación.</strong>"
      },
      "p5": "El consumo de paquetes en NodeJS se basa en NPM y la carpeta node_modules, Deno directamente consume las dependencias como imports HTTP.\n",
      "p6": "Los browsers modernos cuentan con la capacidad de consumir módulos (ES, SJS o AMD), pero si programas para web, a diferencia de cuando programas para NodeJS o Deno, seguramente estarás utilizando algún empaquetador como webpack, parcel, rollup, esbuild, etc.\n",
      "p7": "Los empaquetadores consumen los paquetes publicados en NPM para generar un archivo final .js, llamado ‘bundle’ que incluye las dependencias como react o vue.\n",
      "p8": "También puedes usar empaquetadores para programar en Deno o NodeJS, algo que se está volviendo popular debido al Isomorfismo o que lo utilizan frameworks como Nest o Next.",
      "p9": "BeyondJS implementa un diseño modular que sigue las mismas reglas para cualquier plataforma. Los proyectos se componen de pequeñas unidades de código denominadas bundles las cuales son empaquetadas por separado y se disponibilizan por medio de un DevServer en entorno de desarrollo y como archivos compilados en entorno productivo."
    }
  }
}
