{
    "en": {
        "projectTemplate": {
            "title": "Project template",
            "p1": "BeyondJS provides a simple but robust architecture for managing templates in projects, which has the following features:",
            "items": [
                "<strong>Styles</strong>: Built-in support for LESS and SASS preprocessors.",
                "<strong>CSS properties</strong>: A basic variable structure that allows you to work with web components efficiently.",
                "<strong>Global Style</strong>: Global style sheet for the project.",
                "<strong>Override</strong>: A unique feature that allows you to redefine the styles and texts of existing modules without having to touch the original code.",
                "<strong>Code separation</strong>: Independent handling of the style files with an automated process for generating independent and optimized final files.",
                "Integrated <strong>Light & Dark Theme</strong>"
            ]
        },

        "Settings": {
            "title": "Settings",
            "p1": {
                "t1": "The template configuration, like all elements in BeyondJS, is handled by a configuration file whose name, by convention, is template.json and is located in the template folder at the project root. However, both name and location are configurable values in the ",
                "link": [
                    "/project/config",
                    "project.json"
                ]
            },

            "p2": {
                "t1": "The template can be managed from the ",
                "link": [
                    "Dashboard",
                    "/docs/dashboard"
                ],
                "t2": ". And when a project is created, the default structure is already configured for its management."
            },

            "p3": "Explained below, are the configuration properties.",
            "p4": "The application and global properties receive the same configuration parameters but have different purposes.",
            "title2": "template.application",
            "p5": "The application configuration property represents the general styles project's file. Its main focus is to be the place where the custom CSS properties are defined and any style that needs to be applied to the general document, external to the widgets.",
            "p6": "<strong>Custom properties</strong> play a key role in handling widgets. Web components with Shadow DOM are not affected by the general website styles, where they are included-in. CSS properties, however, can be accessed and used.",
            "p7": {
                "t1": "Style management can be reviewed in detail in the",
                "link": [
                    "/docs/styles/template",
                    "Styles of the template chapter"
                ]
            },

            "title3": "template.global",
            "p8": "Its purpose is to provide the developer with the possibility of sharing code between widgets. The files added in the global configuration are compiled into a file named global.css, which is included in the shadow dom of each widget so that they have access to the styles.",
            "title4": "Configuration parameters",
            "p9": "As can seen in the previous code, the configuration of both properties works the same, they receive an object with the following properties:",
            "p10": "As you can see in the above code, you can define three properties:",
            "items": [
                "Processor: Processor to use. Supports sass and less",
                "Path: Directory where the files are located, if not defined, all the files related to the location of the configuration file will be searched.",
                "Files: the * indicates that any file within the defined path should be taken into consideration. If files are specified by name, only the indicated files will be taken into account."
            ]
        }
    }
}