{
    "es": {
        "projectTemplate": {
            "title": "Plantilla de un proyecto",
            "p1": "BeyondJS brinda una arquitectura simple pero robusta para el manejo de plantillas en los proyectos, la cual cuenta con las siguientes caracteristicas:",
            "items": [
                "<strong>Estilos</strong>: Soporte integrado de preprocesadores LESS y SASS.",
                "<strong>Propiedades CSS</strong>: Estructura básica de variables que permite trabajar con los componentes web eficientemente.",
                "<strong>Estilo Global</strong>: Hoja de estilo global para el proyecto.",
                "<strong>Sobreescritura</strong>: Esto es una característica especial que permite redefinir estilos y textos de módulos existentes sin necesidad de tocar el código original.",
                "<strong>Separacion de codigo</strong>: Manejo independiente de los archivos de estilos con proceso automatizado para la generación de archivos finales independientes y optimizados.",
                "<strong>Light & Dark Theme</strong> Integrados."
            ]
        },
        "settings": {
            "title": "Configuración",
            "p1": {
                "t1": "La configuración de la plantilla, al igual que todos los elementos en BeyondJS, se maneja por medio de un archivo de configuración, cuyo nombre, por convención es template.json y se ubica en la carpeta template en la raiz del proyecto. Sin embargo, tanto el nombre como la ubicación son valores configurables en el ",
                "link": [
                    "/project/config",
                    "project.json"
                ]
            },
            "p2": {
                "t1": "La plantilla puede ser manejada desde el ",
                "link": [
                    "Dashboard",
                    "/docs/dashboard"
                ],
                "t2": ". Y cuando se crea un proyecto ya viene configurada la estructura por defecto para su manejo."
            },
            "p3": "A continuación se explican las propiedades de configuración",
            "p4": "Las propiedades application y global reciben los mismos parametros de configuración, pero tienen fines distintos.",
            "title2": "template.application",
            "p5": "La propiedad de configuración application representa al archivo de estilos generales del proyecto y tiene como foco principal ser el lugar en donde se definan las propiedades css personalizadas y cualquier estilo que se requiera aplicar al documento general, externo a los widgets.",
            "p6": "Las <strong>custom properties</strong> juegan un papel importante en el manejo de los widgets. Los componentes webs con Shadow DOM no se ven afectados por los estilos generales del sitio web en donde están incluidos. Sin embargo, las propiedades css si pueden ser accedidas y utilizadas.",
            "p7": {
                "t1": "El manejo de estilos puede verse en detalle en la sección de ",
                "link": [
                    "/docs/styles/template",
                    "Estilos en la plantilla"
                ]
            },
            "title3": "template.global",
            "p8": "Tiene como finalidad suministrar al desarrollador la posibilidad de compartir código entre widgets. Los archivos agregados en la configuración de global, son compilados en un archivo de nombre global.css, que es incluido en el shadow dom de cada widget para que tengan acceso a los estilos.",
            "title4": "Parametros de configuración",
            "p9": "Cómo se puede ver en el código anterior, la configuración de ambas propiedades funciona igual, reciben un objeto con las siguientes propiedades:",
            "p10": "Cómo se puede ver en el código anterior, se puede definir tres propiedades",
            "items": [
                "Processor: Procesador a utilizar. Soporta sass y less",
                "Path: Directorio donde se encuentran los archivos, sino se define se buscaran todos los archivos relativos a la ubicación del archivo de configuración.",
                "Files: el * indica que se debe tomar en cuenta cualquier archivo adentro del path definido. Si se específican archivos por nombre, sólo se tomara en cuenta los archivos indicados."
            ]
        }
    }
}